In [1]:
print("Hello World")

Hello World

In [8]:
import pandas as pd
ps = pd.Series([10,20,30,40])

In [17]:
ps[:3]

0    10
1    20
2    30
dtype: int64

In [21]:
ps = pd.Series([10,20,30,40,50,60,70,80,90,100])

In [19]:
ps[:]

0     10
1     20
2     30
3     40
4     50
5     60
6     70
7     80
8     90
9    100
dtype: int64

In [20]:
ps[1:]

1     20
2     30
3     40
4     50
5     60
6     70
7     80
8     90
9    100
dtype: int64

In [22]:
ps[4:]

4     50
5     60
6     70
7     80
8     90
9    100
dtype: int64

In [23]:
ps[:5]

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [24]:
ps[1:8]

1    20
2    30
3    40
4    50
5    60
6    70
7    80
dtype: int64

In [25]:
datas = [10, 20, 30, 40, 50]

In [26]:
df = pd.DataFrame(datas)
df

    0
0  10
1  20
2  30
3  40
4  50

In [27]:
datas_tp = (59, 60, 25, 32)

In [28]:
df = pd.DataFrame(datas_tp) #Tuple
df

    0
0  59
1  60
2  25
3  32

In [29]:
# Addition Column
cols = ['Age']
df = pd.DataFrame(datas_tp, columns=cols)
df

   Age
0   59
1   60
2   25
3   32

In [33]:
datas = [['keyboard', 'IT',4000],['Doll', 'Toy', 500],['mouse', 'IT', 300],['Iphone12','Mobile',40000]]
cols = ['product_name', 'category', 'price']
df = pd.DataFrame(datas, columns=cols)
df

  product_name category  price
0     keyboard       IT   4000
1         Doll      Toy    500
2        mouse       IT    300
3     Iphone12   Mobile  40000

In [35]:
#use Zip To create DataFrame
product_name = ['keyboard', 'Doll','mouse']
category = ['IT', 'Toy', 'IT']
price = [400, 500, 300]
datas = list(zip(product_name,category,price))
cols = ['product_name', 'category', 'price']
df = pd.DataFrame(datas, columns=cols)
df

  product_name category  price
0     keyboard       IT    400
1         Doll      Toy    500
2        mouse       IT    300

In [10]:
#Create DataFrame from dictionary
import pandas as pd

products = [
    {"Name":"Keyboard","Category":"Hardware","Price":500},
    {"Name":"Mouse","Category":"Hardware","Price":300},
    {"Name":"Doll","Category":"Toy","Price":900},
    {"Name":"Durian","Category":"Fruit","Price":70}
]

In [13]:
df = pd.DataFrame(products)
df

       Name  Category  Price
0  Keyboard  Hardware    500
1     Mouse  Hardware    300
2      Doll       Toy    900
3    Durian     Fruit     70

In [16]:
#Set Index use by column
df.set_index(["Name"], inplace=True)

In [17]:
df

          Category  Price
Name
Keyboard  Hardware    500
Mouse     Hardware    300
Doll           Toy    900
Durian       Fruit     70

In [18]:
#Create Data frame from series
name = ['keyboard', 'mouse', 'Doll']
category = ['Hardware', 'Hardware', 'Toy']
price = [500, 300,900]

In [19]:
#Series
name_series = pd.Series(name)
category_series = pd.Series(category)
price_series = pd.Series(price)

In [21]:
frame = {"Name":name_series, "Category":category_series, "Price":price_series}

In [22]:
df = pd.DataFrame(frame)
df

       Name  Category  Price
0  keyboard  Hardware    500
1     mouse  Hardware    300
2      Doll       Toy    900

In [23]:
df.set_index(["Name"], inplace=True)
df

          Category  Price
Name
keyboard  Hardware    500
mouse     Hardware    300
Doll           Toy    900

## Export Dataframe to CSV file

In [29]:
df.to_csv("products.csv")

### Read Data From CSV file

In [30]:
dfs = pd.read_csv(r"D:\Learning_code\Python_Tutorial\products.csv", encoding="utf-8")

In [31]:
dfs

       Name  Category  Price
0  keyboard  Hardware    500
1     mouse  Hardware    300
2      Doll       Toy    900

In [34]:
cols = ["Name","Price"]
dfs = pd.read_csv(r"D:\Learning_code\Python_Tutorial\products.csv", encoding="utf-8", usecols=cols, 
                  index_col="Name")
dfs

          Price
Name
keyboard    500
mouse       300
Doll        900

In [35]:
dfs = pd.read_csv(r"D:\Learning_code\Python_Tutorial\products.csv", encoding="utf-8", index_col="Name")
dfs

          Category  Price
Name
keyboard  Hardware    500
mouse     Hardware    300
Doll           Toy    900

In [37]:
pd.read_csv("products3.csv")

  keyboard  Hardware  500
0    mouse  Hardware  300
1     Doll       Toy  900

In [38]:
colsname = ["name", "catagory", "price"]
df = pd.read_csv("products3.csv", encoding="utf-8", names=colsname)
df

       name  catagory  price
0  keyboard  Hardware    500
1     mouse  Hardware    300
2      Doll       Toy    900